zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SPC.h
#define SPC_LP_CFG_IO_LVDE_MASK                  (0x4000000U)
#define SPC_LP_CFG_IO_LVDE_SHIFT                 (26U)
/*! IO_LVDE - IO Low Voltage Detect Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_LP_CFG_IO_LVDE(x)                    (((uint32_t)(((uint32_t)(x)) << SPC_LP_CFG_IO_LVDE_SHIFT)) & SPC_LP_CFG_IO_LVDE_MASK)

#define SPC_LP_CFG_CORE_HVDE_MASK                (0x8000000U)
#define SPC_LP_CFG_CORE_HVDE_SHIFT               (27U)
/*! CORE_HVDE - Core High Voltage Detect Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_LP_CFG_CORE_HVDE(x)                  (((uint32_t)(((uint32_t)(x)) << SPC_LP_CFG_CORE_HVDE_SHIFT)) & SPC_LP_CFG_CORE_HVDE_MASK)

#define SPC_LP_CFG_IO_HVDE_MASK                  (0x20000000U)
#define SPC_LP_CFG_IO_HVDE_SHIFT                 (29U)
/*! IO_HVDE - IO High Voltage Detect Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_LP_CFG_IO_HVDE(x)                    (((uint32_t)(((uint32_t)(x)) << SPC_LP_CFG_IO_HVDE_SHIFT)) & SPC_LP_CFG_IO_HVDE_MASK)

#define SPC_LP_CFG_VDD1P8_LVDE_MASK              (0x40000000U)
#define SPC_LP_CFG_VDD1P8_LVDE_SHIFT             (30U)
/*! VDD1P8_LVDE - VDD 1P8 Low-Voltage Detection Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_LP_CFG_VDD1P8_LVDE(x)                (((uint32_t)(((uint32_t)(x)) << SPC_LP_CFG_VDD1P8_LVDE_SHIFT)) & SPC_LP_CFG_VDD1P8_LVDE_MASK)
/*! @} */

/*! @name LP_CFG1 - Low Power Mode Configuration 1 */
/*! @{ */

#define SPC_LP_CFG1_SOC_CNTRL_MASK               (0xFFFFFFFFU)
#define SPC_LP_CFG1_SOC_CNTRL_SHIFT              (0U)
/*! SOC_CNTRL - Low-Power Configuration Chip Control */
#define SPC_LP_CFG1_SOC_CNTRL(x)                 (((uint32_t)(((uint32_t)(x)) << SPC_LP_CFG1_SOC_CNTRL_SHIFT)) & SPC_LP_CFG1_SOC_CNTRL_MASK)
/*! @} */

/*! @name HP_CFG - High Power Mode Configuration */
/*! @{ */

#define SPC_HP_CFG_CORELDO_VDD_DS_MASK           (0x1U)
#define SPC_HP_CFG_CORELDO_VDD_DS_SHIFT          (0U)
/*! CORELDO_VDD_DS - LDO_CORE VDD Drive Strength
 *  0b0..Low
 *  0b1..Normal
 */
#define SPC_HP_CFG_CORELDO_VDD_DS(x)             (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_CORELDO_VDD_DS_SHIFT)) & SPC_HP_CFG_CORELDO_VDD_DS_MASK)

#define SPC_HP_CFG_CORELDO_VDD_LVL_MASK          (0xCU)
#define SPC_HP_CFG_CORELDO_VDD_LVL_SHIFT         (2U)
/*! CORELDO_VDD_LVL - LDO_CORE VDD Regulator Voltage Level
 *  0b00..
 *  0b01..Regulate to mid voltage (1.0 V)
 *  0b10..Regulate to normal voltage (1.1 V)
 *  0b11..Regulate to safe-mode voltage (1.15 V)
 */
#define SPC_HP_CFG_CORELDO_VDD_LVL(x)            (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_CORELDO_VDD_LVL_SHIFT)) & SPC_HP_CFG_CORELDO_VDD_LVL_MASK)

#define SPC_HP_CFG_DCDC_VDD_DS_MASK              (0x300U)
#define SPC_HP_CFG_DCDC_VDD_DS_SHIFT             (8U)
/*! DCDC_VDD_DS - DCDC VDD Drive Strength
 *  0b01..Low
 *  0b10..Normal
 */
#define SPC_HP_CFG_DCDC_VDD_DS(x)                (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_DCDC_VDD_DS_SHIFT)) & SPC_HP_CFG_DCDC_VDD_DS_MASK)

#define SPC_HP_CFG_DCDC_VDD_LVL_MASK             (0xC00U)
#define SPC_HP_CFG_DCDC_VDD_LVL_SHIFT            (10U)
/*! DCDC_VDD_LVL - DCDC VDD Regulator Voltage Level
 *  0b00..Low undervoltage (1.25 V)
 *  0b01..Normal voltage (1.35 V)
 *  0b10..Mid voltage (1.45 V)
 *  0b11..Safe-mode voltage (1.8 V)
 */
#define SPC_HP_CFG_DCDC_VDD_LVL(x)               (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_DCDC_VDD_LVL_SHIFT)) & SPC_HP_CFG_DCDC_VDD_LVL_MASK)

#define SPC_HP_CFG_DCDC_VOUT2P5_SEL_MASK         (0x1000U)
#define SPC_HP_CFG_DCDC_VOUT2P5_SEL_SHIFT        (12U)
/*! DCDC_VOUT2P5_SEL - 2.5 V Output Select
 *  0b0..From DCDC_VDD_LVL register
 *  0b1..2.5 V
 */
#define SPC_HP_CFG_DCDC_VOUT2P5_SEL(x)           (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_DCDC_VOUT2P5_SEL_SHIFT)) & SPC_HP_CFG_DCDC_VOUT2P5_SEL_MASK)

#define SPC_HP_CFG_GLITCH_DETECT_DISABLE_MASK    (0x2000U)
#define SPC_HP_CFG_GLITCH_DETECT_DISABLE_SHIFT   (13U)
/*! GLITCH_DETECT_DISABLE - Glitch Detect Disable
 *  0b0..Low Voltage Glitch Detect enabled
 *  0b1..Low Voltage Glitch Detect disabled
 */
#define SPC_HP_CFG_GLITCH_DETECT_DISABLE(x)      (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_GLITCH_DETECT_DISABLE_SHIFT)) & SPC_HP_CFG_GLITCH_DETECT_DISABLE_MASK)

#define SPC_HP_CFG_BGMODE_MASK                   (0x300000U)
#define SPC_HP_CFG_BGMODE_SHIFT                  (20U)
/*! BGMODE - Bandgap Mode
 *  0b00..Bandgap disabled
 *  0b01..Bandgap enabled, buffer disabled
 *  0b10..Bandgap enabled, buffer enabled
 *  0b11..
 */
#define SPC_HP_CFG_BGMODE(x)                     (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_BGMODE_SHIFT)) & SPC_HP_CFG_BGMODE_MASK)

#define SPC_HP_CFG_VDD_VD_DISABLE_MASK           (0x800000U)
#define SPC_HP_CFG_VDD_VD_DISABLE_SHIFT          (23U)
/*! VDD_VD_DISABLE - VDD Voltage Detect Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define SPC_HP_CFG_VDD_VD_DISABLE(x)             (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_VDD_VD_DISABLE_SHIFT)) & SPC_HP_CFG_VDD_VD_DISABLE_MASK)

#define SPC_HP_CFG_CORE_LVDE_MASK                (0x1000000U)
#define SPC_HP_CFG_CORE_LVDE_SHIFT               (24U)
/*! CORE_LVDE - Core Low-Voltage Detection Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_HP_CFG_CORE_LVDE(x)                  (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_CORE_LVDE_SHIFT)) & SPC_HP_CFG_CORE_LVDE_MASK)

#define SPC_HP_CFG_IO_LVDE_MASK                  (0x4000000U)
#define SPC_HP_CFG_IO_LVDE_SHIFT                 (26U)
/*! IO_LVDE - IO Low-Voltage Detection Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_HP_CFG_IO_LVDE(x)                    (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_IO_LVDE_SHIFT)) & SPC_HP_CFG_IO_LVDE_MASK)

#define SPC_HP_CFG_CORE_HVDE_MASK                (0x8000000U)
#define SPC_HP_CFG_CORE_HVDE_SHIFT               (27U)
/*! CORE_HVDE - Core High-Voltage Detection Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_HP_CFG_CORE_HVDE(x)                  (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_CORE_HVDE_SHIFT)) & SPC_HP_CFG_CORE_HVDE_MASK)

#define SPC_HP_CFG_IO_HVDE_MASK                  (0x20000000U)
#define SPC_HP_CFG_IO_HVDE_SHIFT                 (29U)
/*! IO_HVDE - IO High-Voltage Detection Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_HP_CFG_IO_HVDE(x)                    (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_IO_HVDE_SHIFT)) & SPC_HP_CFG_IO_HVDE_MASK)

#define SPC_HP_CFG_VDD1P8_LVDE_MASK              (0x40000000U)
#define SPC_HP_CFG_VDD1P8_LVDE_SHIFT             (30U)
/*! VDD1P8_LVDE - VDD 1P8 Low-Voltage Detection Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_HP_CFG_VDD1P8_LVDE(x)                (((uint32_t)(((uint32_t)(x)) << SPC_HP_CFG_VDD1P8_LVDE_SHIFT)) & SPC_HP_CFG_VDD1P8_LVDE_MASK)
/*! @} */

/*! @name LPWKUP_DELAY - Low Power Wake-Up Delay */
/*! @{ */

#define SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK       (0xFFFFU)
#define SPC_LPWKUP_DELAY_LPWKUP_DELAY_SHIFT      (0U)
/*! LPWKUP_DELAY - Low-Power Wake-Up Delay */
#define SPC_LPWKUP_DELAY_LPWKUP_DELAY(x)         (((uint32_t)(((uint32_t)(x)) << SPC_LPWKUP_DELAY_LPWKUP_DELAY_SHIFT)) & SPC_LPWKUP_DELAY_LPWKUP_DELAY_MASK)
/*! @} */

/*! @name ACTIVE_VDELAY - Active Voltage Trim Delay */
/*! @{ */

