zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SPC.h
#define SPC_EVD_CFG_EVDLPISO_MASK                (0x700U)
#define SPC_EVD_CFG_EVDLPISO_SHIFT               (8U)
/*! EVDLPISO - External Voltage Domain Low-Power Isolation */
#define SPC_EVD_CFG_EVDLPISO(x)                  (((uint32_t)(((uint32_t)(x)) << SPC_EVD_CFG_EVDLPISO_SHIFT)) & SPC_EVD_CFG_EVDLPISO_MASK)

#define SPC_EVD_CFG_EVDSTAT_MASK                 (0x70000U)
#define SPC_EVD_CFG_EVDSTAT_SHIFT                (16U)
/*! EVDSTAT - External Voltage Domain Status */
#define SPC_EVD_CFG_EVDSTAT(x)                   (((uint32_t)(((uint32_t)(x)) << SPC_EVD_CFG_EVDSTAT_SHIFT)) & SPC_EVD_CFG_EVDSTAT_MASK)
/*! @} */

/*! @name VDD_GLITCH_DETECT_SC - Glitch Detect Status Control */
/*! @{ */

#define SPC_VDD_GLITCH_DETECT_SC_CNT_SELECT_MASK (0x3U)
#define SPC_VDD_GLITCH_DETECT_SC_CNT_SELECT_SHIFT (0U)
/*! CNT_SELECT - Counter Select
 *  0b00..0
 *  0b01..1
 *  0b10..2
 *  0b11..3
 */
#define SPC_VDD_GLITCH_DETECT_SC_CNT_SELECT(x)   (((uint32_t)(((uint32_t)(x)) << SPC_VDD_GLITCH_DETECT_SC_CNT_SELECT_SHIFT)) & SPC_VDD_GLITCH_DETECT_SC_CNT_SELECT_MASK)

#define SPC_VDD_GLITCH_DETECT_SC_TIMEOUT_MASK    (0x3CU)
#define SPC_VDD_GLITCH_DETECT_SC_TIMEOUT_SHIFT   (2U)
/*! TIMEOUT - Timeout */
#define SPC_VDD_GLITCH_DETECT_SC_TIMEOUT(x)      (((uint32_t)(((uint32_t)(x)) << SPC_VDD_GLITCH_DETECT_SC_TIMEOUT_SHIFT)) & SPC_VDD_GLITCH_DETECT_SC_TIMEOUT_MASK)

#define SPC_VDD_GLITCH_DETECT_SC_RE_MASK         (0x40U)
#define SPC_VDD_GLITCH_DETECT_SC_RE_SHIFT        (6U)
/*! RE - Glitch Detect Reset Enable
 *  0b0..GLITCH_DETECT_FLAG[CNT_SELECT] does not generate POR/LVD reset
 *  0b1..GLITCH_DETECT_FLAG[CNT_SELECT] does generate POR/LVD reset
 */
#define SPC_VDD_GLITCH_DETECT_SC_RE(x)           (((uint32_t)(((uint32_t)(x)) << SPC_VDD_GLITCH_DETECT_SC_RE_SHIFT)) & SPC_VDD_GLITCH_DETECT_SC_RE_MASK)

#define SPC_VDD_GLITCH_DETECT_SC_IE_MASK         (0x80U)
#define SPC_VDD_GLITCH_DETECT_SC_IE_SHIFT        (7U)
/*! IE - Glitch Detect Interrupt Enable
 *  0b0..GLITCH_DETECT_FLAG[CNT_SELECT] does not generate hardware interrupt (user polling)
 *  0b1..GLITCH_DETECT_FLAG[CNT_SELECT] does generate hardware interrupt
 */
#define SPC_VDD_GLITCH_DETECT_SC_IE(x)           (((uint32_t)(((uint32_t)(x)) << SPC_VDD_GLITCH_DETECT_SC_IE_SHIFT)) & SPC_VDD_GLITCH_DETECT_SC_IE_MASK)

#define SPC_VDD_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG_MASK (0xF00U)
#define SPC_VDD_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG_SHIFT (8U)
/*! GLITCH_DETECT_FLAG - GLITCH_DETECT_FLAG */
#define SPC_VDD_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG(x) (((uint32_t)(((uint32_t)(x)) << SPC_VDD_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG_SHIFT)) & SPC_VDD_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG_MASK)

#define SPC_VDD_GLITCH_DETECT_SC_LOCK_MASK       (0x10000U)
#define SPC_VDD_GLITCH_DETECT_SC_LOCK_SHIFT      (16U)
/*! LOCK - Glitch Detect Reset Enable Lock Bit
 *  0b0..Writes to RE are allowed.
 *  0b1..Writes to RE are ignored.
 */
#define SPC_VDD_GLITCH_DETECT_SC_LOCK(x)         (((uint32_t)(((uint32_t)(x)) << SPC_VDD_GLITCH_DETECT_SC_LOCK_SHIFT)) & SPC_VDD_GLITCH_DETECT_SC_LOCK_MASK)

#define SPC_VDD_GLITCH_DETECT_SC_HIGH_GAIN_MODE_MASK (0x20000U)
#define SPC_VDD_GLITCH_DETECT_SC_HIGH_GAIN_MODE_SHIFT (17U)
/*! HIGH_GAIN_MODE - High Gain Mode Enable
 *  0b0..High Gain Model disabled.
 *  0b1..High Gain Model enabled.
 */
#define SPC_VDD_GLITCH_DETECT_SC_HIGH_GAIN_MODE(x) (((uint32_t)(((uint32_t)(x)) << SPC_VDD_GLITCH_DETECT_SC_HIGH_GAIN_MODE_SHIFT)) & SPC_VDD_GLITCH_DETECT_SC_HIGH_GAIN_MODE_MASK)

#define SPC_VDD_GLITCH_DETECT_SC_HVDD_AMP_DISABLE_MASK (0x40000U)
#define SPC_VDD_GLITCH_DETECT_SC_HVDD_AMP_DISABLE_SHIFT (18U)
/*! HVDD_AMP_DISABLE - HVDD AMP DISABLE
 *  0b0..HVDD Amplifier detection enabled.
 *  0b1..HVDD Amplifier detection disabled.
 */
#define SPC_VDD_GLITCH_DETECT_SC_HVDD_AMP_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << SPC_VDD_GLITCH_DETECT_SC_HVDD_AMP_DISABLE_SHIFT)) & SPC_VDD_GLITCH_DETECT_SC_HVDD_AMP_DISABLE_MASK)
/*! @} */

/*! @name CORELDO_CFG - LDO_CORE Configuration */
/*! @{ */

#define SPC_CORELDO_CFG_DPDOWN_LDO_EN_MASK       (0x8U)
#define SPC_CORELDO_CFG_DPDOWN_LDO_EN_SHIFT      (3U)
/*! DPDOWN_LDO_EN - LDO_CORE Deep Power Down Reg Enable
 *  0b0..LDO_CORE disabled in Deep Power Down
 *  0b1..LDO_CORE enabled in Deep Power Down
 */
#define SPC_CORELDO_CFG_DPDOWN_LDO_EN(x)         (((uint32_t)(((uint32_t)(x)) << SPC_CORELDO_CFG_DPDOWN_LDO_EN_SHIFT)) & SPC_CORELDO_CFG_DPDOWN_LDO_EN_MASK)

#define SPC_CORELDO_CFG_PASSTHROUGH_MASK         (0x100U)
#define SPC_CORELDO_CFG_PASSTHROUGH_SHIFT        (8U)
/*! PASSTHROUGH - LDO_CORE Pass Through Enable */
#define SPC_CORELDO_CFG_PASSTHROUGH(x)           (((uint32_t)(((uint32_t)(x)) << SPC_CORELDO_CFG_PASSTHROUGH_SHIFT)) & SPC_CORELDO_CFG_PASSTHROUGH_MASK)

#define SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE_MASK (0x800000U)
#define SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE_SHIFT (23U)
/*! DPDOWN_PULLDOWN_DISABLE - LDO_CORE Deep Power Down Pulldown Disable
 *  0b0..LDO_CORE pulldown in Deep Power Down not disabled
 *  0b1..LDO_CORE pulldown in Deep Power Down disabled
 */
#define SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE_SHIFT)) & SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE_MASK)
/*! @} */

/*! @name DCDC_CFG - DCDC Configuration */
/*! @{ */

#define SPC_DCDC_CFG_DPDOWN_LDO_EN_MASK          (0x8U)
#define SPC_DCDC_CFG_DPDOWN_LDO_EN_SHIFT         (3U)
/*! DPDOWN_LDO_EN - DCDC Deep Power Down Enable
 *  0b0..DCDC disabled in Deep Power Down
 *  0b1..DCDC enabled in Deep Power Down
 */
#define SPC_DCDC_CFG_DPDOWN_LDO_EN(x)            (((uint32_t)(((uint32_t)(x)) << SPC_DCDC_CFG_DPDOWN_LDO_EN_SHIFT)) & SPC_DCDC_CFG_DPDOWN_LDO_EN_MASK)

#define SPC_DCDC_CFG_RAMP_CNTRL_EN_MASK          (0x100000U)
#define SPC_DCDC_CFG_RAMP_CNTRL_EN_SHIFT         (20U)
/*! RAMP_CNTRL_EN - DCDC Trim Step Enable */
#define SPC_DCDC_CFG_RAMP_CNTRL_EN(x)            (((uint32_t)(((uint32_t)(x)) << SPC_DCDC_CFG_RAMP_CNTRL_EN_SHIFT)) & SPC_DCDC_CFG_RAMP_CNTRL_EN_MASK)

#define SPC_DCDC_CFG_RAMP_CNTRL_MASK             (0xE00000U)
#define SPC_DCDC_CFG_RAMP_CNTRL_SHIFT            (21U)
/*! RAMP_CNTRL - DCDC Ramp Control Select */
#define SPC_DCDC_CFG_RAMP_CNTRL(x)               (((uint32_t)(((uint32_t)(x)) << SPC_DCDC_CFG_RAMP_CNTRL_SHIFT)) & SPC_DCDC_CFG_RAMP_CNTRL_MASK)

#define SPC_DCDC_CFG_RAMP_CNTRL_LP_MASK          (0x7000000U)
#define SPC_DCDC_CFG_RAMP_CNTRL_LP_SHIFT         (24U)
/*! RAMP_CNTRL_LP - DCDC Ramp Control Select */
#define SPC_DCDC_CFG_RAMP_CNTRL_LP(x)            (((uint32_t)(((uint32_t)(x)) << SPC_DCDC_CFG_RAMP_CNTRL_LP_SHIFT)) & SPC_DCDC_CFG_RAMP_CNTRL_LP_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SPC_Register_Masks */


/*!
 * @}
 */ /* end of group SPC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SPC_H_ */

